БИТУправление_медицинским_центром_демо/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <comment>Общие рабочие поручения и персональные задания</comment>
  <basedOn>Document.Событие</basedOn>
  <addressing>InformationRegister.Адресация</addressing>
  <attributes>
    <name>ВидЗадачиНапоминания</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыЗадачИНапоминаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>Characteristic.ВидыЗадачИНапоминаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

БИТУправление_медицинским_центром_демо/src/Tasks/ЗадачиПользователя/Forms/ФормаПараметрыУдаленияСтарыхЗадач/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьЗадачи(Команда)
	УдалитьЗадачиСервер();
	Оповестить("ИзменениеЗадачи");
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьЗадачиСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ЗадачиПользователя.Ссылка
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.СрокИсполнения <= &Дата
	|	И НЕ ЗадачиПользователя.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(ВидЗадачи) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗадачиПользователя.ВидЗадачиНапоминания = &ВидЗадачиНапоминания";
	КонецЕсли;
	
	Если УдалитьВыполненные Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗадачиПользователя.Выполнена";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", КонецДня(СрокИсполнения));
	Запрос.УстановитьПараметр("ВидЗадачиНапоминания", ВидЗадачи);
	
	счТр = 0;
	КолОперацийВТранзакции = 500;
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл			
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
		
		счТр = счТр + 1;
		Если счТр = КолОперацийВТранзакции Тогда
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
			счТр = 0;
		КонецЕсли;
		
	КонецЦикла;	 
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры

#КонецОбласти
